---
title: NonContinuousRailInfo
classe: Autodesk.Revit.DB.Architecture.NonContinuousRailInfo
namespace: Autodesk.Revit.DB.Architecture
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 11
---

# NonContinuousRailInfo

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double Height { get; set; }` | `nonContinuousRailInfo.Height` | Double |
| `Boolean IsValidObject { get; }` | `nonContinuousRailInfo.IsValidObject` | Boolean |
| `ElementId MaterialId { get; set; }` | `nonContinuousRailInfo.MaterialId` | ElementId |
| `String Name { get; set; }` | `nonContinuousRailInfo.Name` | String |
| `Double Offset { get; set; }` | `nonContinuousRailInfo.Offset` | Double |
| `ElementId ProfileId { get; set; }` | `nonContinuousRailInfo.ProfileId` | ElementId |
| `Void Dispose()` | `nonContinuousRailInfo.Dispose()` | Void |
| `Boolean IsValidNonContinuousRailHeight(Double)` | `nonContinuousRailInfo.IsValidNonContinuousRailHeight(height)` | Boolean |
| `Boolean IsValidNonContinuousRailMaterial(ElementId)` | `nonContinuousRailInfo.IsValidNonContinuousRailMaterial(materialId)` | Boolean |
| `Boolean IsValidNonContinuousRailName(String)` | `nonContinuousRailInfo.IsValidNonContinuousRailName(name)` | Boolean |
| `Boolean IsValidNonContinuousRailProfile(ElementId)` | `nonContinuousRailInfo.IsValidNonContinuousRailProfile(profileId)` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```